Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
/*
 * Component description for USB
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_USB_COMPONENT_H_
#define _PIC32WM_BZ6_USB_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR USB                       */
/* ************************************************************************** */

/* -------- USB_UEPx : (USB Offset: 0x00) (R/W 32) USB Endpoint Control Registers -------- */
#define USB_UEPx_EPHSHK_Pos                   _UINT32_(0)                                          /* (USB_UEPx) Endpoint Handshake Enable bit Position */
#define USB_UEPx_EPHSHK_Msk                   (_UINT32_(0x1) << USB_UEPx_EPHSHK_Pos)               /* (USB_UEPx) Endpoint Handshake Enable bit Mask */
#define USB_UEPx_EPHSHK(value)                (USB_UEPx_EPHSHK_Msk & (_UINT32_(value) << USB_UEPx_EPHSHK_Pos)) /* Assignment of value for EPHSHK in the USB_UEPx register */
#define   USB_UEPx_EPHSHK_ON_Val              _UINT32_(0x1)                                        /* (USB_UEPx) Endpoint Handshake is enabled  */
#define   USB_UEPx_EPHSHK_OFF_Val             _UINT32_(0x0)                                        /* (USB_UEPx) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USB_UEPx_EPHSHK_ON                    (USB_UEPx_EPHSHK_ON_Val << USB_UEPx_EPHSHK_Pos)      /* (USB_UEPx) Endpoint Handshake is enabled Position */
#define USB_UEPx_EPHSHK_OFF                   (USB_UEPx_EPHSHK_OFF_Val << USB_UEPx_EPHSHK_Pos)     /* (USB_UEPx) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position */
#define USB_UEPx_EPSTALL_Pos                  _UINT32_(1)                                          /* (USB_UEPx) Endpoint Stall Status bit Position */
#define USB_UEPx_EPSTALL_Msk                  (_UINT32_(0x1) << USB_UEPx_EPSTALL_Pos)              /* (USB_UEPx) Endpoint Stall Status bit Mask */
#define USB_UEPx_EPSTALL(value)               (USB_UEPx_EPSTALL_Msk & (_UINT32_(value) << USB_UEPx_EPSTALL_Pos)) /* Assignment of value for EPSTALL in the USB_UEPx register */
#define   USB_UEPx_EPSTALL_STALL_Val          _UINT32_(0x1)                                        /* (USB_UEPx) Endpoint 1 was stalled  */
#define   USB_UEPx_EPSTALL_NOT_STALL_Val      _UINT32_(0x0)                                        /* (USB_UEPx) Endpoint 1 was not stalled  */
#define USB_UEPx_EPSTALL_STALL                (USB_UEPx_EPSTALL_STALL_Val << USB_UEPx_EPSTALL_Pos) /* (USB_UEPx) Endpoint 1 was stalled Position */
#define USB_UEPx_EPSTALL_NOT_STALL            (USB_UEPx_EPSTALL_NOT_STALL_Val << USB_UEPx_EPSTALL_Pos) /* (USB_UEPx) Endpoint 1 was not stalled Position */
#define USB_UEPx_EPTXEN_Pos                   _UINT32_(2)                                          /* (USB_UEPx) Endpoint Transmit Enable bit Position */
#define USB_UEPx_EPTXEN_Msk                   (_UINT32_(0x1) << USB_UEPx_EPTXEN_Pos)               /* (USB_UEPx) Endpoint Transmit Enable bit Mask */
#define USB_UEPx_EPTXEN(value)                (USB_UEPx_EPTXEN_Msk & (_UINT32_(value) << USB_UEPx_EPTXEN_Pos)) /* Assignment of value for EPTXEN in the USB_UEPx register */
#define   USB_UEPx_EPTXEN_ON_Val              _UINT32_(0x1)                                        /* (USB_UEPx) Endpoint 1 transmit is enabled  */
#define   USB_UEPx_EPTXEN_OFF_Val             _UINT32_(0x0)                                        /* (USB_UEPx) Endpoint 1 transmit is disabled  */
#define USB_UEPx_EPTXEN_ON                    (USB_UEPx_EPTXEN_ON_Val << USB_UEPx_EPTXEN_Pos)      /* (USB_UEPx) Endpoint 1 transmit is enabled Position */
#define USB_UEPx_EPTXEN_OFF                   (USB_UEPx_EPTXEN_OFF_Val << USB_UEPx_EPTXEN_Pos)     /* (USB_UEPx) Endpoint 1 transmit is disabled Position */
#define USB_UEPx_EPRXEN_Pos                   _UINT32_(3)                                          /* (USB_UEPx) Endpoint Receive Enable bit Position */
#define USB_UEPx_EPRXEN_Msk                   (_UINT32_(0x1) << USB_UEPx_EPRXEN_Pos)               /* (USB_UEPx) Endpoint Receive Enable bit Mask */
#define USB_UEPx_EPRXEN(value)                (USB_UEPx_EPRXEN_Msk & (_UINT32_(value) << USB_UEPx_EPRXEN_Pos)) /* Assignment of value for EPRXEN in the USB_UEPx register */
#define   USB_UEPx_EPRXEN_ON_Val              _UINT32_(0x1)                                        /* (USB_UEPx) Endpoint 1 receive is enabled  */
#define   USB_UEPx_EPRXEN_OFF_Val             _UINT32_(0x0)                                        /* (USB_UEPx) Endpoint 1 receive is disabled  */
#define USB_UEPx_EPRXEN_ON                    (USB_UEPx_EPRXEN_ON_Val << USB_UEPx_EPRXEN_Pos)      /* (USB_UEPx) Endpoint 1 receive is enabled Position */
#define USB_UEPx_EPRXEN_OFF                   (USB_UEPx_EPRXEN_OFF_Val << USB_UEPx_EPRXEN_Pos)     /* (USB_UEPx) Endpoint 1 receive is disabled Position */
#define USB_UEPx_EPCONDIS_Pos                 _UINT32_(4)                                          /* (USB_UEPx) Bidirectional Endpoint Control bit Position */
#define USB_UEPx_EPCONDIS_Msk                 (_UINT32_(0x1) << USB_UEPx_EPCONDIS_Pos)             /* (USB_UEPx) Bidirectional Endpoint Control bit Mask */
#define USB_UEPx_EPCONDIS(value)              (USB_UEPx_EPCONDIS_Msk & (_UINT32_(value) << USB_UEPx_EPCONDIS_Pos)) /* Assignment of value for EPCONDIS in the USB_UEPx register */
#define   USB_UEPx_EPCONDIS_DISABLE_1_Val     _UINT32_(0x1)                                        /* (USB_UEPx) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 1 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USB_UEPx_EPCONDIS_ENABLE_1_Val      _UINT32_(0x0)                                        /* (USB_UEPx) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 1 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USB_UEPx_EPCONDIS_DISABLE_1           (USB_UEPx_EPCONDIS_DISABLE_1_Val << USB_UEPx_EPCONDIS_Pos) /* (USB_UEPx) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 1 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position */
#define USB_UEPx_EPCONDIS_ENABLE_1            (USB_UEPx_EPCONDIS_ENABLE_1_Val << USB_UEPx_EPCONDIS_Pos) /* (USB_UEPx) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 1 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position */
#define USB_UEPx_RETRYDIS_Pos                 _UINT32_(6)                                          /* (USB_UEPx) Retry Disable bit Position */
#define USB_UEPx_RETRYDIS_Msk                 (_UINT32_(0x1) << USB_UEPx_RETRYDIS_Pos)             /* (USB_UEPx) Retry Disable bit Mask */
#define USB_UEPx_RETRYDIS(value)              (USB_UEPx_RETRYDIS_Msk & (_UINT32_(value) << USB_UEPx_RETRYDIS_Pos)) /* Assignment of value for RETRYDIS in the USB_UEPx register */
#define   USB_UEPx_RETRYDIS_ON_Val            _UINT32_(0x1)                                        /* (USB_UEPx) Retry NAKed transactions is disabled  */
#define   USB_UEPx_RETRYDIS_OFF_Val           _UINT32_(0x0)                                        /* (USB_UEPx) Retry NAKed transactions is enabled; retry done in hardware  */
#define USB_UEPx_RETRYDIS_ON                  (USB_UEPx_RETRYDIS_ON_Val << USB_UEPx_RETRYDIS_Pos)  /* (USB_UEPx) Retry NAKed transactions is disabled Position */
#define USB_UEPx_RETRYDIS_OFF                 (USB_UEPx_RETRYDIS_OFF_Val << USB_UEPx_RETRYDIS_Pos) /* (USB_UEPx) Retry NAKed transactions is enabled; retry done in hardware Position */
#define USB_UEPx_LSPD_Pos                     _UINT32_(7)                                          /* (USB_UEPx) Low-Speed Direct Connection Enable bit Position */
#define USB_UEPx_LSPD_Msk                     (_UINT32_(0x1) << USB_UEPx_LSPD_Pos)                 /* (USB_UEPx) Low-Speed Direct Connection Enable bit Mask */
#define USB_UEPx_LSPD(value)                  (USB_UEPx_LSPD_Msk & (_UINT32_(value) << USB_UEPx_LSPD_Pos)) /* Assignment of value for LSPD in the USB_UEPx register */
#define   USB_UEPx_LSPD_ON_Val                _UINT32_(0x1)                                        /* (USB_UEPx) Direct connection to a low-speed device is enabled  */
#define   USB_UEPx_LSPD_OFF_Val               _UINT32_(0x0)                                        /* (USB_UEPx) Direct connection to a low-speed device is disabled; hub required with PRE_PID  */
#define USB_UEPx_LSPD_ON                      (USB_UEPx_LSPD_ON_Val << USB_UEPx_LSPD_Pos)          /* (USB_UEPx) Direct connection to a low-speed device is enabled Position */
#define USB_UEPx_LSPD_OFF                     (USB_UEPx_LSPD_OFF_Val << USB_UEPx_LSPD_Pos)         /* (USB_UEPx) Direct connection to a low-speed device is disabled; hub required with PRE_PID Position */
#define USB_UEPx_Msk                          _UINT32_(0x000000DF)                                 /* (USB_UEPx) Register Mask  */


