Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
/* -------- USB_UOTGIESET : (USB Offset: 0x58) (R/W 32)  -------- */
#define USB_UOTGIESET_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UOTGIESET)   Reset Value */

#define USB_UOTGIESET_Msk                     _UINT32_(0x00000000)                                 /* (USB_UOTGIESET) Register Mask  */


/* -------- USB_UOTGIEINV : (USB Offset: 0x5C) (R/W 32)  -------- */
#define USB_UOTGIEINV_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UOTGIEINV)   Reset Value */

#define USB_UOTGIEINV_Msk                     _UINT32_(0x00000000)                                 /* (USB_UOTGIEINV) Register Mask  */


/* -------- USB_UOTGSTAT : (USB Offset: 0x60) (R/W 32) USB OTG Status Register -------- */
#define USB_UOTGSTAT_VBUSVD_Pos               _UINT32_(0)                                          /* (USB_UOTGSTAT) A-VBUS Valid Indicator bit Position */
#define USB_UOTGSTAT_VBUSVD_Msk               (_UINT32_(0x1) << USB_UOTGSTAT_VBUSVD_Pos)           /* (USB_UOTGSTAT) A-VBUS Valid Indicator bit Mask */
#define USB_UOTGSTAT_VBUSVD(value)            (USB_UOTGSTAT_VBUSVD_Msk & (_UINT32_(value) << USB_UOTGSTAT_VBUSVD_Pos)) /* Assignment of value for VBUSVD in the USB_UOTGSTAT register */
#define   USB_UOTGSTAT_VBUSVD_ABOVE_Val       _UINT32_(0x1)                                        /* (USB_UOTGSTAT) Vbus voltage is above VA_VBUS_VLD on the A device  */
#define   USB_UOTGSTAT_VBUSVD_BELOW_Val       _UINT32_(0x0)                                        /* (USB_UOTGSTAT) Vbus voltage is below VA_VBUS_VLD on the A device  */
#define USB_UOTGSTAT_VBUSVD_ABOVE             (USB_UOTGSTAT_VBUSVD_ABOVE_Val << USB_UOTGSTAT_VBUSVD_Pos) /* (USB_UOTGSTAT) Vbus voltage is above VA_VBUS_VLD on the A device Position */
#define USB_UOTGSTAT_VBUSVD_BELOW             (USB_UOTGSTAT_VBUSVD_BELOW_Val << USB_UOTGSTAT_VBUSVD_Pos) /* (USB_UOTGSTAT) Vbus voltage is below VA_VBUS_VLD on the A device Position */
#define USB_UOTGSTAT_SESEND_Pos               _UINT32_(2)                                          /* (USB_UOTGSTAT) B-Session End Indicator bit Position */
#define USB_UOTGSTAT_SESEND_Msk               (_UINT32_(0x1) << USB_UOTGSTAT_SESEND_Pos)           /* (USB_UOTGSTAT) B-Session End Indicator bit Mask */
#define USB_UOTGSTAT_SESEND(value)            (USB_UOTGSTAT_SESEND_Msk & (_UINT32_(value) << USB_UOTGSTAT_SESEND_Pos)) /* Assignment of value for SESEND in the USB_UOTGSTAT register */
#define   USB_UOTGSTAT_SESEND_BELOW_Val       _UINT32_(0x1)                                        /* (USB_UOTGSTAT) Vbus voltage is below VB_SESS_END on the B device  */
#define   USB_UOTGSTAT_SESEND_ABOVE_Val       _UINT32_(0x0)                                        /* (USB_UOTGSTAT) Vbus voltage is above VB_SESS_END on the B device  */
#define USB_UOTGSTAT_SESEND_BELOW             (USB_UOTGSTAT_SESEND_BELOW_Val << USB_UOTGSTAT_SESEND_Pos) /* (USB_UOTGSTAT) Vbus voltage is below VB_SESS_END on the B device Position */
#define USB_UOTGSTAT_SESEND_ABOVE             (USB_UOTGSTAT_SESEND_ABOVE_Val << USB_UOTGSTAT_SESEND_Pos) /* (USB_UOTGSTAT) Vbus voltage is above VB_SESS_END on the B device Position */
#define USB_UOTGSTAT_SESVD_Pos                _UINT32_(3)                                          /* (USB_UOTGSTAT) Session Valid Indicator bit Position */
#define USB_UOTGSTAT_SESVD_Msk                (_UINT32_(0x1) << USB_UOTGSTAT_SESVD_Pos)            /* (USB_UOTGSTAT) Session Valid Indicator bit Mask */
#define USB_UOTGSTAT_SESVD(value)             (USB_UOTGSTAT_SESVD_Msk & (_UINT32_(value) << USB_UOTGSTAT_SESVD_Pos)) /* Assignment of value for SESVD in the USB_UOTGSTAT register */
#define   USB_UOTGSTAT_SESVD_ABOVE_Val        _UINT32_(0x1)                                        /* (USB_UOTGSTAT) Vbus voltage is above Session Valid on the A or B device  */
#define   USB_UOTGSTAT_SESVD_BELOW_Val        _UINT32_(0x0)                                        /* (USB_UOTGSTAT) Vbus voltage is below Session Valid on the A or B device  */
#define USB_UOTGSTAT_SESVD_ABOVE              (USB_UOTGSTAT_SESVD_ABOVE_Val << USB_UOTGSTAT_SESVD_Pos) /* (USB_UOTGSTAT) Vbus voltage is above Session Valid on the A or B device Position */
#define USB_UOTGSTAT_SESVD_BELOW              (USB_UOTGSTAT_SESVD_BELOW_Val << USB_UOTGSTAT_SESVD_Pos) /* (USB_UOTGSTAT) Vbus voltage is below Session Valid on the A or B device Position */
#define USB_UOTGSTAT_LSTATE_Pos               _UINT32_(5)                                          /* (USB_UOTGSTAT) Line State Stable Indicator bit Position */
#define USB_UOTGSTAT_LSTATE_Msk               (_UINT32_(0x1) << USB_UOTGSTAT_LSTATE_Pos)           /* (USB_UOTGSTAT) Line State Stable Indicator bit Mask */
#define USB_UOTGSTAT_LSTATE(value)            (USB_UOTGSTAT_LSTATE_Msk & (_UINT32_(value) << USB_UOTGSTAT_LSTATE_Pos)) /* Assignment of value for LSTATE in the USB_UOTGSTAT register */
#define   USB_UOTGSTAT_LSTATE_STABLE_Val      _UINT32_(0x1)                                        /* (USB_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has been stable for the previous 1 ms  */
#define   USB_UOTGSTAT_LSTATE_NOT_STABLE_Val  _UINT32_(0x0)                                        /* (USB_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has not been stable for the previous 1 ms  */
#define USB_UOTGSTAT_LSTATE_STABLE            (USB_UOTGSTAT_LSTATE_STABLE_Val << USB_UOTGSTAT_LSTATE_Pos) /* (USB_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has been stable for the previous 1 ms Position */
#define USB_UOTGSTAT_LSTATE_NOT_STABLE        (USB_UOTGSTAT_LSTATE_NOT_STABLE_Val << USB_UOTGSTAT_LSTATE_Pos) /* (USB_UOTGSTAT) USB line state (UCTRL[SE0 and JSTATE]) has not been stable for the previous 1 ms Position */
#define USB_UOTGSTAT_ID_Pos                   _UINT32_(7)                                          /* (USB_UOTGSTAT) ID Pin State Indicator bit Position */
#define USB_UOTGSTAT_ID_Msk                   (_UINT32_(0x1) << USB_UOTGSTAT_ID_Pos)               /* (USB_UOTGSTAT) ID Pin State Indicator bit Mask */
#define USB_UOTGSTAT_ID(value)                (USB_UOTGSTAT_ID_Msk & (_UINT32_(value) << USB_UOTGSTAT_ID_Pos)) /* Assignment of value for ID in the USB_UOTGSTAT register */
#define   USB_UOTGSTAT_ID_NOT_PLUG_Val        _UINT32_(0x1)                                        /* (USB_UOTGSTAT) No cable is attached or a Type-B cable has been plugged into the USB receptacle  */
#define   USB_UOTGSTAT_ID_PLUG_Val            _UINT32_(0x0)                                        /* (USB_UOTGSTAT) A Type-A cable has been plugged into the USB receptacle  */
#define USB_UOTGSTAT_ID_NOT_PLUG              (USB_UOTGSTAT_ID_NOT_PLUG_Val << USB_UOTGSTAT_ID_Pos) /* (USB_UOTGSTAT) No cable is attached or a Type-B cable has been plugged into the USB receptacle Position */
#define USB_UOTGSTAT_ID_PLUG                  (USB_UOTGSTAT_ID_PLUG_Val << USB_UOTGSTAT_ID_Pos)    /* (USB_UOTGSTAT) A Type-A cable has been plugged into the USB receptacle Position */
#define USB_UOTGSTAT_Msk                      _UINT32_(0x000000AD)                                 /* (USB_UOTGSTAT) Register Mask  */


