Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
#define USB_UOTGCONSET_Msk                    _UINT32_(0x00000000)                                 /* (USB_UOTGCONSET) Register Mask  */


/* -------- USB_UOTGCONINV : (USB Offset: 0x7C) (R/W 32)  -------- */
#define USB_UOTGCONINV_RESETVALUE             _UINT32_(0x00)                                       /*  (USB_UOTGCONINV)   Reset Value */

#define USB_UOTGCONINV_Msk                    _UINT32_(0x00000000)                                 /* (USB_UOTGCONINV) Register Mask  */


/* -------- USB_UPWRC : (USB Offset: 0x80) (R/W 32) USB Power Control Register -------- */
#define USB_UPWRC_USBPWR_Pos                  _UINT32_(0)                                          /* (USB_UPWRC) USB Operation Enable bit Position */
#define USB_UPWRC_USBPWR_Msk                  (_UINT32_(0x1) << USB_UPWRC_USBPWR_Pos)              /* (USB_UPWRC) USB Operation Enable bit Mask */
#define USB_UPWRC_USBPWR(value)               (USB_UPWRC_USBPWR_Msk & (_UINT32_(value) << USB_UPWRC_USBPWR_Pos)) /* Assignment of value for USBPWR in the USB_UPWRC register */
#define   USB_UPWRC_USBPWR_ON_Val             _UINT32_(0x1)                                        /* (USB_UPWRC) USB module is turned on  */
#define   USB_UPWRC_USBPWR_OFF_Val            _UINT32_(0x0)                                        /* (USB_UPWRC) USB module is disabled (Outputs held inactive  */
#define USB_UPWRC_USBPWR_ON                   (USB_UPWRC_USBPWR_ON_Val << USB_UPWRC_USBPWR_Pos)    /* (USB_UPWRC) USB module is turned on Position */
#define USB_UPWRC_USBPWR_OFF                  (USB_UPWRC_USBPWR_OFF_Val << USB_UPWRC_USBPWR_Pos)   /* (USB_UPWRC) USB module is disabled (Outputs held inactive Position */
#define USB_UPWRC_USUSPEND_Pos                _UINT32_(1)                                          /* (USB_UPWRC) USB Suspend Mode bit Position */
#define USB_UPWRC_USUSPEND_Msk                (_UINT32_(0x1) << USB_UPWRC_USUSPEND_Pos)            /* (USB_UPWRC) USB Suspend Mode bit Mask */
#define USB_UPWRC_USUSPEND(value)             (USB_UPWRC_USUSPEND_Msk & (_UINT32_(value) << USB_UPWRC_USUSPEND_Pos)) /* Assignment of value for USUSPEND in the USB_UPWRC register */
#define   USB_UPWRC_USUSPEND_SUSPEND_Val      _UINT32_(0x1)                                        /* (USB_UPWRC) USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.)  */
#define   USB_UPWRC_USUSPEND_NORMAL_Val       _UINT32_(0x0)                                        /* (USB_UPWRC) USB module operates normally  */
#define USB_UPWRC_USUSPEND_SUSPEND            (USB_UPWRC_USUSPEND_SUSPEND_Val << USB_UPWRC_USUSPEND_Pos) /* (USB_UPWRC) USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.) Position */
#define USB_UPWRC_USUSPEND_NORMAL             (USB_UPWRC_USUSPEND_NORMAL_Val << USB_UPWRC_USUSPEND_Pos) /* (USB_UPWRC) USB module operates normally Position */
#define USB_UPWRC_USBBUSY_Pos                 _UINT32_(3)                                          /* (USB_UPWRC) USB Module Busy bit Position */
#define USB_UPWRC_USBBUSY_Msk                 (_UINT32_(0x1) << USB_UPWRC_USBBUSY_Pos)             /* (USB_UPWRC) USB Module Busy bit Mask */
#define USB_UPWRC_USBBUSY(value)              (USB_UPWRC_USBBUSY_Msk & (_UINT32_(value) << USB_UPWRC_USBBUSY_Pos)) /* Assignment of value for USBBUSY in the USB_UPWRC register */
#define   USB_UPWRC_USBBUSY_ACTIVE_OR_DISALBE_Val _UINT32_(0x1)                                        /* (USB_UPWRC) USB module is active or disabled  */
#define   USB_UPWRC_USBBUSY_NOT_ACTIVE_AND_READY_Val _UINT32_(0x0)                                        /* (USB_UPWRC) USB module is not active and is ready to be enabled  */
#define USB_UPWRC_USBBUSY_ACTIVE_OR_DISALBE   (USB_UPWRC_USBBUSY_ACTIVE_OR_DISALBE_Val << USB_UPWRC_USBBUSY_Pos) /* (USB_UPWRC) USB module is active or disabled Position */
#define USB_UPWRC_USBBUSY_NOT_ACTIVE_AND_READY (USB_UPWRC_USBBUSY_NOT_ACTIVE_AND_READY_Val << USB_UPWRC_USBBUSY_Pos) /* (USB_UPWRC) USB module is not active and is ready to be enabled Position */
#define USB_UPWRC_USLPGRD_Pos                 _UINT32_(4)                                          /* (USB_UPWRC) USB Sleep Entry Guard bit Position */
#define USB_UPWRC_USLPGRD_Msk                 (_UINT32_(0x1) << USB_UPWRC_USLPGRD_Pos)             /* (USB_UPWRC) USB Sleep Entry Guard bit Mask */
#define USB_UPWRC_USLPGRD(value)              (USB_UPWRC_USLPGRD_Msk & (_UINT32_(value) << USB_UPWRC_USLPGRD_Pos)) /* Assignment of value for USLPGRD in the USB_UPWRC register */
#define   USB_UPWRC_USLPGRD_BLOCK_SLEEP_Val   _UINT32_(0x1)                                        /* (USB_UPWRC) Sleep entry is blocked if USB bus activity is detected or if a notification is pending  */
#define   USB_UPWRC_USLPGRD_NO_BLOCK_Val      _UINT32_(0x0)                                        /* (USB_UPWRC) USB module does not block Sleep entry  */
#define USB_UPWRC_USLPGRD_BLOCK_SLEEP         (USB_UPWRC_USLPGRD_BLOCK_SLEEP_Val << USB_UPWRC_USLPGRD_Pos) /* (USB_UPWRC) Sleep entry is blocked if USB bus activity is detected or if a notification is pending Position */
#define USB_UPWRC_USLPGRD_NO_BLOCK            (USB_UPWRC_USLPGRD_NO_BLOCK_Val << USB_UPWRC_USLPGRD_Pos) /* (USB_UPWRC) USB module does not block Sleep entry Position */
#define USB_UPWRC_UACTPND_Pos                 _UINT32_(7)                                          /* (USB_UPWRC) USB Activity Pending bit Position */
#define USB_UPWRC_UACTPND_Msk                 (_UINT32_(0x1) << USB_UPWRC_UACTPND_Pos)             /* (USB_UPWRC) USB Activity Pending bit Mask */
#define USB_UPWRC_UACTPND(value)              (USB_UPWRC_UACTPND_Msk & (_UINT32_(value) << USB_UPWRC_UACTPND_Pos)) /* Assignment of value for UACTPND in the USB_UPWRC register */
#define   USB_UPWRC_UACTPND_CHANGE_Val        _UINT32_(0x1)                                        /* (USB_UPWRC) USB hardware has detected a change in link status  */
#define   USB_UPWRC_UACTPND_NORMAL_Val        _UINT32_(0x0)                                        /* (USB_UPWRC) USB Hardware in normal operation mode  */
#define USB_UPWRC_UACTPND_CHANGE              (USB_UPWRC_UACTPND_CHANGE_Val << USB_UPWRC_UACTPND_Pos) /* (USB_UPWRC) USB hardware has detected a change in link status Position */
#define USB_UPWRC_UACTPND_NORMAL              (USB_UPWRC_UACTPND_NORMAL_Val << USB_UPWRC_UACTPND_Pos) /* (USB_UPWRC) USB Hardware in normal operation mode Position */
#define USB_UPWRC_Msk                         _UINT32_(0x0000009B)                                 /* (USB_UPWRC) Register Mask  */


/* -------- USB_UPWRCCLR : (USB Offset: 0x84) (R/W 32)  -------- */
#define USB_UPWRCCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UPWRCCLR)   Reset Value */

#define USB_UPWRCCLR_Msk                      _UINT32_(0x00000000)                                 /* (USB_UPWRCCLR) Register Mask  */


/* -------- USB_UPWRCSET : (USB Offset: 0x88) (R/W 32)  -------- */
#define USB_UPWRCSET_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UPWRCSET)   Reset Value */

#define USB_UPWRCSET_Msk                      _UINT32_(0x00000000)                                 /* (USB_UPWRCSET) Register Mask  */


/* -------- USB_UPWRCINV : (USB Offset: 0x8C) (R/W 32)  -------- */
#define USB_UPWRCINV_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UPWRCINV)   Reset Value */

