Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
/* -------- USB_UIRCLR : (USB Offset: 0x204) (R/W 32)  -------- */
#define USB_UIRCLR_RESETVALUE                 _UINT32_(0x00)                                       /*  (USB_UIRCLR)   Reset Value */

#define USB_UIRCLR_Msk                        _UINT32_(0x00000000)                                 /* (USB_UIRCLR) Register Mask  */


/* -------- USB_UIE : (USB Offset: 0x210) (R/W 32) USB Interrupt Enable Register -------- */
#define USB_UIE_URSTIE_DETACHIE_Pos           _UINT32_(0)                                          /* (USB_UIE) (Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode Position */
#define USB_UIE_URSTIE_DETACHIE_Msk           (_UINT32_(0x1) << USB_UIE_URSTIE_DETACHIE_Pos)       /* (USB_UIE) (Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode Mask */
#define USB_UIE_URSTIE_DETACHIE(value)        (USB_UIE_URSTIE_DETACHIE_Msk & (_UINT32_(value) << USB_UIE_URSTIE_DETACHIE_Pos)) /* Assignment of value for URSTIE_DETACHIE in the USB_UIE register */
#define   USB_UIE_URSTIE_DETACHIE_ON_Val      _UINT32_(0x1)                                        /* (USB_UIE) (Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled  */
#define   USB_UIE_URSTIE_DETACHIE_OFF_Val     _UINT32_(0x0)                                        /* (USB_UIE) (Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled  */
#define USB_UIE_URSTIE_DETACHIE_ON            (USB_UIE_URSTIE_DETACHIE_ON_Val << USB_UIE_URSTIE_DETACHIE_Pos) /* (USB_UIE) (Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled Position */
#define USB_UIE_URSTIE_DETACHIE_OFF           (USB_UIE_URSTIE_DETACHIE_OFF_Val << USB_UIE_URSTIE_DETACHIE_Pos) /* (USB_UIE) (Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled Position */
#define USB_UIE_UERRIE_Pos                    _UINT32_(1)                                          /* (USB_UIE) USB Error Interrupt Enable bit Position */
#define USB_UIE_UERRIE_Msk                    (_UINT32_(0x1) << USB_UIE_UERRIE_Pos)                /* (USB_UIE) USB Error Interrupt Enable bit Mask */
#define USB_UIE_UERRIE(value)                 (USB_UIE_UERRIE_Msk & (_UINT32_(value) << USB_UIE_UERRIE_Pos)) /* Assignment of value for UERRIE in the USB_UIE register */
#define   USB_UIE_UERRIE_ON_Val               _UINT32_(0x1)                                        /* (USB_UIE) USB Error interrupt is enabled  */
#define   USB_UIE_UERRIE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UIE) USB Error interrupt is disabled  */
#define USB_UIE_UERRIE_ON                     (USB_UIE_UERRIE_ON_Val << USB_UIE_UERRIE_Pos)        /* (USB_UIE) USB Error interrupt is enabled Position */
#define USB_UIE_UERRIE_OFF                    (USB_UIE_UERRIE_OFF_Val << USB_UIE_UERRIE_Pos)       /* (USB_UIE) USB Error interrupt is disabled Position */
#define USB_UIE_SOFIE_Pos                     _UINT32_(2)                                          /* (USB_UIE) SOF Token Interrupt Enable bit Position */
#define USB_UIE_SOFIE_Msk                     (_UINT32_(0x1) << USB_UIE_SOFIE_Pos)                 /* (USB_UIE) SOF Token Interrupt Enable bit Mask */
#define USB_UIE_SOFIE(value)                  (USB_UIE_SOFIE_Msk & (_UINT32_(value) << USB_UIE_SOFIE_Pos)) /* Assignment of value for SOFIE in the USB_UIE register */
#define   USB_UIE_SOFIE_ON_Val                _UINT32_(0x1)                                        /* (USB_UIE) SOFIF interrupt is enabled  */
#define   USB_UIE_SOFIE_OFF_Val               _UINT32_(0x0)                                        /* (USB_UIE) SOFIF interrupt is disabled  */
#define USB_UIE_SOFIE_ON                      (USB_UIE_SOFIE_ON_Val << USB_UIE_SOFIE_Pos)          /* (USB_UIE) SOFIF interrupt is enabled Position */
#define USB_UIE_SOFIE_OFF                     (USB_UIE_SOFIE_OFF_Val << USB_UIE_SOFIE_Pos)         /* (USB_UIE) SOFIF interrupt is disabled Position */
#define USB_UIE_TRNIE_Pos                     _UINT32_(3)                                          /* (USB_UIE) Token Processing Complete Interrupt Enable bit Position */
#define USB_UIE_TRNIE_Msk                     (_UINT32_(0x1) << USB_UIE_TRNIE_Pos)                 /* (USB_UIE) Token Processing Complete Interrupt Enable bit Mask */
#define USB_UIE_TRNIE(value)                  (USB_UIE_TRNIE_Msk & (_UINT32_(value) << USB_UIE_TRNIE_Pos)) /* Assignment of value for TRNIE in the USB_UIE register */
#define   USB_UIE_TRNIE_ON_Val                _UINT32_(0x1)                                        /* (USB_UIE) TRNIF interrupt is enabled  */
#define   USB_UIE_TRNIE_OFF_Val               _UINT32_(0x0)                                        /* (USB_UIE) TRNIF interrupt is disabled  */
#define USB_UIE_TRNIE_ON                      (USB_UIE_TRNIE_ON_Val << USB_UIE_TRNIE_Pos)          /* (USB_UIE) TRNIF interrupt is enabled Position */
#define USB_UIE_TRNIE_OFF                     (USB_UIE_TRNIE_OFF_Val << USB_UIE_TRNIE_Pos)         /* (USB_UIE) TRNIF interrupt is disabled Position */
#define USB_UIE_IDLEIE_Pos                    _UINT32_(4)                                          /* (USB_UIE) Idle Detect Interrupt Enable bit Position */
#define USB_UIE_IDLEIE_Msk                    (_UINT32_(0x1) << USB_UIE_IDLEIE_Pos)                /* (USB_UIE) Idle Detect Interrupt Enable bit Mask */
#define USB_UIE_IDLEIE(value)                 (USB_UIE_IDLEIE_Msk & (_UINT32_(value) << USB_UIE_IDLEIE_Pos)) /* Assignment of value for IDLEIE in the USB_UIE register */
#define   USB_UIE_IDLEIE_ON_Val               _UINT32_(0x1)                                        /* (USB_UIE) Idle interrupt is enabled  */
#define   USB_UIE_IDLEIE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UIE) Idle interrupt is disabled  */
#define USB_UIE_IDLEIE_ON                     (USB_UIE_IDLEIE_ON_Val << USB_UIE_IDLEIE_Pos)        /* (USB_UIE) Idle interrupt is enabled Position */
#define USB_UIE_IDLEIE_OFF                    (USB_UIE_IDLEIE_OFF_Val << USB_UIE_IDLEIE_Pos)       /* (USB_UIE) Idle interrupt is disabled Position */
#define USB_UIE_RESUMEIE_Pos                  _UINT32_(5)                                          /* (USB_UIE) RESUME Interrupt Enable bit Position */
#define USB_UIE_RESUMEIE_Msk                  (_UINT32_(0x1) << USB_UIE_RESUMEIE_Pos)              /* (USB_UIE) RESUME Interrupt Enable bit Mask */
#define USB_UIE_RESUMEIE(value)               (USB_UIE_RESUMEIE_Msk & (_UINT32_(value) << USB_UIE_RESUMEIE_Pos)) /* Assignment of value for RESUMEIE in the USB_UIE register */
#define   USB_UIE_RESUMEIE_ON_Val             _UINT32_(0x1)                                        /* (USB_UIE) RESUME interrupt is enabled  */
#define   USB_UIE_RESUMEIE_OFF_Val            _UINT32_(0x0)                                        /* (USB_UIE) RESUME interrupt is disabled  */
#define USB_UIE_RESUMEIE_ON                   (USB_UIE_RESUMEIE_ON_Val << USB_UIE_RESUMEIE_Pos)    /* (USB_UIE) RESUME interrupt is enabled Position */
#define USB_UIE_RESUMEIE_OFF                  (USB_UIE_RESUMEIE_OFF_Val << USB_UIE_RESUMEIE_Pos)   /* (USB_UIE) RESUME interrupt is disabled Position */
#define USB_UIE_ATTACHIE_Pos                  _UINT32_(6)                                          /* (USB_UIE) ATTACH Interrupt Enable bit Position */
#define USB_UIE_ATTACHIE_Msk                  (_UINT32_(0x1) << USB_UIE_ATTACHIE_Pos)              /* (USB_UIE) ATTACH Interrupt Enable bit Mask */
#define USB_UIE_ATTACHIE(value)               (USB_UIE_ATTACHIE_Msk & (_UINT32_(value) << USB_UIE_ATTACHIE_Pos)) /* Assignment of value for ATTACHIE in the USB_UIE register */
#define   USB_UIE_ATTACHIE_ON_Val             _UINT32_(0x1)                                        /* (USB_UIE) ATTACH interrupt is enabled  */
#define   USB_UIE_ATTACHIE_OFF_Val            _UINT32_(0x0)                                        /* (USB_UIE) ATTACH interrupt is disabled  */
#define USB_UIE_ATTACHIE_ON                   (USB_UIE_ATTACHIE_ON_Val << USB_UIE_ATTACHIE_Pos)    /* (USB_UIE) ATTACH interrupt is enabled Position */
#define USB_UIE_ATTACHIE_OFF                  (USB_UIE_ATTACHIE_OFF_Val << USB_UIE_ATTACHIE_Pos)   /* (USB_UIE) ATTACH interrupt is disabled Position */
#define USB_UIE_STALLIE_Pos                   _UINT32_(7)                                          /* (USB_UIE) STALL Handshake Interrupt Enable bit Position */
#define USB_UIE_STALLIE_Msk                   (_UINT32_(0x1) << USB_UIE_STALLIE_Pos)               /* (USB_UIE) STALL Handshake Interrupt Enable bit Mask */
#define USB_UIE_STALLIE(value)                (USB_UIE_STALLIE_Msk & (_UINT32_(value) << USB_UIE_STALLIE_Pos)) /* Assignment of value for STALLIE in the USB_UIE register */
#define   USB_UIE_STALLIE_ON_Val              _UINT32_(0x1)                                        /* (USB_UIE) STALL interrupt is enabled  */
#define   USB_UIE_STALLIE_OFF_Val             _UINT32_(0x0)                                        /* (USB_UIE) STALL interrupt is disabled  */
#define USB_UIE_STALLIE_ON                    (USB_UIE_STALLIE_ON_Val << USB_UIE_STALLIE_Pos)      /* (USB_UIE) STALL interrupt is enabled Position */
#define USB_UIE_STALLIE_OFF                   (USB_UIE_STALLIE_OFF_Val << USB_UIE_STALLIE_Pos)     /* (USB_UIE) STALL interrupt is disabled Position */
#define USB_UIE_Msk                           _UINT32_(0x000000FF)                                 /* (USB_UIE) Register Mask  */


