Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
/* -------- USB_UEIRCLR : (USB Offset: 0x224) (R/W 32)  -------- */
#define USB_UEIRCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEIRCLR)   Reset Value */

#define USB_UEIRCLR_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEIRCLR) Register Mask  */


/* -------- USB_UEIE : (USB Offset: 0x230) (R/W 32) USB Error Interrupt Enable Register -------- */
#define USB_UEIE_PIDEE_Pos                    _UINT32_(0)                                          /* (USB_UEIE) PID Check Failure Interrupt Enable bit Position */
#define USB_UEIE_PIDEE_Msk                    (_UINT32_(0x1) << USB_UEIE_PIDEE_Pos)                /* (USB_UEIE) PID Check Failure Interrupt Enable bit Mask */
#define USB_UEIE_PIDEE(value)                 (USB_UEIE_PIDEE_Msk & (_UINT32_(value) << USB_UEIE_PIDEE_Pos)) /* Assignment of value for PIDEE in the USB_UEIE register */
#define   USB_UEIE_PIDEE_ON_Val               _UINT32_(0x1)                                        /* (USB_UEIE) PIDEF interrupt is enabled  */
#define   USB_UEIE_PIDEE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UEIE) PIDEF interrupt is disabled  */
#define USB_UEIE_PIDEE_ON                     (USB_UEIE_PIDEE_ON_Val << USB_UEIE_PIDEE_Pos)        /* (USB_UEIE) PIDEF interrupt is enabled Position */
#define USB_UEIE_PIDEE_OFF                    (USB_UEIE_PIDEE_OFF_Val << USB_UEIE_PIDEE_Pos)       /* (USB_UEIE) PIDEF interrupt is disabled Position */
#define USB_UEIE_CRC5EE_EOFEE_Pos             _UINT32_(1)                                          /* (USB_UEIE) (Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit Position */
#define USB_UEIE_CRC5EE_EOFEE_Msk             (_UINT32_(0x1) << USB_UEIE_CRC5EE_EOFEE_Pos)         /* (USB_UEIE) (Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit Mask */
#define USB_UEIE_CRC5EE_EOFEE(value)          (USB_UEIE_CRC5EE_EOFEE_Msk & (_UINT32_(value) << USB_UEIE_CRC5EE_EOFEE_Pos)) /* Assignment of value for CRC5EE_EOFEE in the USB_UEIE register */
#define   USB_UEIE_CRC5EE_EOFEE_ON_Val        _UINT32_(0x1)                                        /* (USB_UEIE) (Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled  */
#define   USB_UEIE_CRC5EE_EOFEE_OFF_Val       _UINT32_(0x0)                                        /* (USB_UEIE) (Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled  */
#define USB_UEIE_CRC5EE_EOFEE_ON              (USB_UEIE_CRC5EE_EOFEE_ON_Val << USB_UEIE_CRC5EE_EOFEE_Pos) /* (USB_UEIE) (Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled Position */
#define USB_UEIE_CRC5EE_EOFEE_OFF             (USB_UEIE_CRC5EE_EOFEE_OFF_Val << USB_UEIE_CRC5EE_EOFEE_Pos) /* (USB_UEIE) (Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled Position */
#define USB_UEIE_CRC16EE_Pos                  _UINT32_(2)                                          /* (USB_UEIE) CRC16 Failure Interrupt Enable bit Position */
#define USB_UEIE_CRC16EE_Msk                  (_UINT32_(0x1) << USB_UEIE_CRC16EE_Pos)              /* (USB_UEIE) CRC16 Failure Interrupt Enable bit Mask */
#define USB_UEIE_CRC16EE(value)               (USB_UEIE_CRC16EE_Msk & (_UINT32_(value) << USB_UEIE_CRC16EE_Pos)) /* Assignment of value for CRC16EE in the USB_UEIE register */
#define   USB_UEIE_CRC16EE_ON_Val             _UINT32_(0x1)                                        /* (USB_UEIE) CRC16EF interrupt is enabled  */
#define   USB_UEIE_CRC16EE_OFF_Val            _UINT32_(0x0)                                        /* (USB_UEIE) CRC16EF interrupt is disabled  */
#define USB_UEIE_CRC16EE_ON                   (USB_UEIE_CRC16EE_ON_Val << USB_UEIE_CRC16EE_Pos)    /* (USB_UEIE) CRC16EF interrupt is enabled Position */
#define USB_UEIE_CRC16EE_OFF                  (USB_UEIE_CRC16EE_OFF_Val << USB_UEIE_CRC16EE_Pos)   /* (USB_UEIE) CRC16EF interrupt is disabled Position */
#define USB_UEIE_DFN8EE_Pos                   _UINT32_(3)                                          /* (USB_UEIE) Data Field Size Error Interrupt Enable bit Position */
#define USB_UEIE_DFN8EE_Msk                   (_UINT32_(0x1) << USB_UEIE_DFN8EE_Pos)               /* (USB_UEIE) Data Field Size Error Interrupt Enable bit Mask */
#define USB_UEIE_DFN8EE(value)                (USB_UEIE_DFN8EE_Msk & (_UINT32_(value) << USB_UEIE_DFN8EE_Pos)) /* Assignment of value for DFN8EE in the USB_UEIE register */
#define   USB_UEIE_DFN8EE_ON_Val              _UINT32_(0x1)                                        /* (USB_UEIE) DFN8EF interrupt is enabled  */
#define   USB_UEIE_DFN8EE_OFF_Val             _UINT32_(0x0)                                        /* (USB_UEIE) DFN8EF interrupt is disabled  */
#define USB_UEIE_DFN8EE_ON                    (USB_UEIE_DFN8EE_ON_Val << USB_UEIE_DFN8EE_Pos)      /* (USB_UEIE) DFN8EF interrupt is enabled Position */
#define USB_UEIE_DFN8EE_OFF                   (USB_UEIE_DFN8EE_OFF_Val << USB_UEIE_DFN8EE_Pos)     /* (USB_UEIE) DFN8EF interrupt is disabled Position */
#define USB_UEIE_BTOEE_Pos                    _UINT32_(4)                                          /* (USB_UEIE) Bus Turnaround Time-out Error Interrupt Enable bit Position */
#define USB_UEIE_BTOEE_Msk                    (_UINT32_(0x1) << USB_UEIE_BTOEE_Pos)                /* (USB_UEIE) Bus Turnaround Time-out Error Interrupt Enable bit Mask */
#define USB_UEIE_BTOEE(value)                 (USB_UEIE_BTOEE_Msk & (_UINT32_(value) << USB_UEIE_BTOEE_Pos)) /* Assignment of value for BTOEE in the USB_UEIE register */
#define   USB_UEIE_BTOEE_ON_Val               _UINT32_(0x1)                                        /* (USB_UEIE) BTOEF interrupt is enabled  */
#define   USB_UEIE_BTOEE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UEIE) BTOEF interrupt is disabled  */
#define USB_UEIE_BTOEE_ON                     (USB_UEIE_BTOEE_ON_Val << USB_UEIE_BTOEE_Pos)        /* (USB_UEIE) BTOEF interrupt is enabled Position */
#define USB_UEIE_BTOEE_OFF                    (USB_UEIE_BTOEE_OFF_Val << USB_UEIE_BTOEE_Pos)       /* (USB_UEIE) BTOEF interrupt is disabled Position */
#define USB_UEIE_DMAEE_Pos                    _UINT32_(5)                                          /* (USB_UEIE) DMA Error Interrupt Enable bit Position */
#define USB_UEIE_DMAEE_Msk                    (_UINT32_(0x1) << USB_UEIE_DMAEE_Pos)                /* (USB_UEIE) DMA Error Interrupt Enable bit Mask */
#define USB_UEIE_DMAEE(value)                 (USB_UEIE_DMAEE_Msk & (_UINT32_(value) << USB_UEIE_DMAEE_Pos)) /* Assignment of value for DMAEE in the USB_UEIE register */
#define   USB_UEIE_DMAEE_ON_Val               _UINT32_(0x1)                                        /* (USB_UEIE) DMAEF interrupt is enabled  */
#define   USB_UEIE_DMAEE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UEIE) DMAEF interrupt is disabled  */
#define USB_UEIE_DMAEE_ON                     (USB_UEIE_DMAEE_ON_Val << USB_UEIE_DMAEE_Pos)        /* (USB_UEIE) DMAEF interrupt is enabled Position */
#define USB_UEIE_DMAEE_OFF                    (USB_UEIE_DMAEE_OFF_Val << USB_UEIE_DMAEE_Pos)       /* (USB_UEIE) DMAEF interrupt is disabled Position */
#define USB_UEIE_BMXEE_Pos                    _UINT32_(6)                                          /* (USB_UEIE) Bus Matrix Error Interrupt Enable bit Position */
#define USB_UEIE_BMXEE_Msk                    (_UINT32_(0x1) << USB_UEIE_BMXEE_Pos)                /* (USB_UEIE) Bus Matrix Error Interrupt Enable bit Mask */
#define USB_UEIE_BMXEE(value)                 (USB_UEIE_BMXEE_Msk & (_UINT32_(value) << USB_UEIE_BMXEE_Pos)) /* Assignment of value for BMXEE in the USB_UEIE register */
#define   USB_UEIE_BMXEE_ON_Val               _UINT32_(0x1)                                        /* (USB_UEIE) BMXEF interrupt is enabled  */
#define   USB_UEIE_BMXEE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UEIE) BMXEF interrupt is disabled  */
#define USB_UEIE_BMXEE_ON                     (USB_UEIE_BMXEE_ON_Val << USB_UEIE_BMXEE_Pos)        /* (USB_UEIE) BMXEF interrupt is enabled Position */
#define USB_UEIE_BMXEE_OFF                    (USB_UEIE_BMXEE_OFF_Val << USB_UEIE_BMXEE_Pos)       /* (USB_UEIE) BMXEF interrupt is disabled Position */
#define USB_UEIE_BTSEE_Pos                    _UINT32_(7)                                          /* (USB_UEIE) Bit Stuff Error Interrupt Enable bit Position */
#define USB_UEIE_BTSEE_Msk                    (_UINT32_(0x1) << USB_UEIE_BTSEE_Pos)                /* (USB_UEIE) Bit Stuff Error Interrupt Enable bit Mask */
#define USB_UEIE_BTSEE(value)                 (USB_UEIE_BTSEE_Msk & (_UINT32_(value) << USB_UEIE_BTSEE_Pos)) /* Assignment of value for BTSEE in the USB_UEIE register */
#define   USB_UEIE_BTSEE_ON_Val               _UINT32_(0x1)                                        /* (USB_UEIE) BTSEF interrupt is enabled  */
#define   USB_UEIE_BTSEE_OFF_Val              _UINT32_(0x0)                                        /* (USB_UEIE) BTSEF interrupt is disabled  */
#define USB_UEIE_BTSEE_ON                     (USB_UEIE_BTSEE_ON_Val << USB_UEIE_BTSEE_Pos)        /* (USB_UEIE) BTSEF interrupt is enabled Position */
#define USB_UEIE_BTSEE_OFF                    (USB_UEIE_BTSEE_OFF_Val << USB_UEIE_BTSEE_Pos)       /* (USB_UEIE) BTSEF interrupt is disabled Position */
#define USB_UEIE_Msk                          _UINT32_(0x000000FF)                                 /* (USB_UEIE) Register Mask  */


