Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
/* -------- USB_UEIECLR : (USB Offset: 0x234) (R/W 32)  -------- */
#define USB_UEIECLR_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEIECLR)   Reset Value */

#define USB_UEIECLR_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEIECLR) Register Mask  */


/* -------- USB_UEIESET : (USB Offset: 0x238) (R/W 32)  -------- */
#define USB_UEIESET_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEIESET)   Reset Value */

#define USB_UEIESET_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEIESET) Register Mask  */


/* -------- USB_UEIEINV : (USB Offset: 0x23C) (R/W 32)  -------- */
#define USB_UEIEINV_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEIEINV)   Reset Value */

#define USB_UEIEINV_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEIEINV) Register Mask  */


/* -------- USB_USTAT : (USB Offset: 0x240) ( R/ 32) USB Status Register -------- */
#define USB_USTAT_PPBI_Pos                    _UINT32_(2)                                          /* (USB_USTAT) Ping-Pong BD Pointer Indicator bit Position */
#define USB_USTAT_PPBI_Msk                    (_UINT32_(0x1) << USB_USTAT_PPBI_Pos)                /* (USB_USTAT) Ping-Pong BD Pointer Indicator bit Mask */
#define USB_USTAT_PPBI(value)                 (USB_USTAT_PPBI_Msk & (_UINT32_(value) << USB_USTAT_PPBI_Pos)) /* Assignment of value for PPBI in the USB_USTAT register */
#define   USB_USTAT_PPBI_ODD_Val              _UINT32_(0x1)                                        /* (USB_USTAT) The last transaction was to the ODD BD bank  */
#define   USB_USTAT_PPBI_EVEN_Val             _UINT32_(0x0)                                        /* (USB_USTAT) The last transaction was to the EVEN BD bank  */
#define USB_USTAT_PPBI_ODD                    (USB_USTAT_PPBI_ODD_Val << USB_USTAT_PPBI_Pos)       /* (USB_USTAT) The last transaction was to the ODD BD bank Position */
#define USB_USTAT_PPBI_EVEN                   (USB_USTAT_PPBI_EVEN_Val << USB_USTAT_PPBI_Pos)      /* (USB_USTAT) The last transaction was to the EVEN BD bank Position */
#define USB_USTAT_DIR_Pos                     _UINT32_(3)                                          /* (USB_USTAT) Last BD Direction Indicator bit Position */
#define USB_USTAT_DIR_Msk                     (_UINT32_(0x1) << USB_USTAT_DIR_Pos)                 /* (USB_USTAT) Last BD Direction Indicator bit Mask */
#define USB_USTAT_DIR(value)                  (USB_USTAT_DIR_Msk & (_UINT32_(value) << USB_USTAT_DIR_Pos)) /* Assignment of value for DIR in the USB_USTAT register */
#define   USB_USTAT_DIR_TX_Val                _UINT32_(0x1)                                        /* (USB_USTAT) Last transaction was a transmit transfer (TX)  */
#define   USB_USTAT_DIR_RX_Val                _UINT32_(0x0)                                        /* (USB_USTAT) Last transaction was a receive transfer (RX)  */
#define USB_USTAT_DIR_TX                      (USB_USTAT_DIR_TX_Val << USB_USTAT_DIR_Pos)          /* (USB_USTAT) Last transaction was a transmit transfer (TX) Position */
#define USB_USTAT_DIR_RX                      (USB_USTAT_DIR_RX_Val << USB_USTAT_DIR_Pos)          /* (USB_USTAT) Last transaction was a receive transfer (RX) Position */
#define USB_USTAT_ENDPT_Pos                   _UINT32_(4)                                          /* (USB_USTAT) Encoded Number of Last Endpoint Activity bits Position */
#define USB_USTAT_ENDPT_Msk                   (_UINT32_(0xF) << USB_USTAT_ENDPT_Pos)               /* (USB_USTAT) Encoded Number of Last Endpoint Activity bits Mask */
#define USB_USTAT_ENDPT(value)                (USB_USTAT_ENDPT_Msk & (_UINT32_(value) << USB_USTAT_ENDPT_Pos)) /* Assignment of value for ENDPT in the USB_USTAT register */
#define   USB_USTAT_ENDPT_EP_15_Val           _UINT32_(0xF)                                        /* (USB_USTAT) Endpoint 15  */
#define   USB_USTAT_ENDPT_EP_14_Val           _UINT32_(0xE)                                        /* (USB_USTAT) Endpoint 14  */
#define   USB_USTAT_ENDPT_EP_1_Val            _UINT32_(0x1)                                        /* (USB_USTAT) Endpoint 1  */
#define   USB_USTAT_ENDPT_EP_0_Val            _UINT32_(0x0)                                        /* (USB_USTAT) Endpoint 0  */
#define USB_USTAT_ENDPT_EP_15                 (USB_USTAT_ENDPT_EP_15_Val << USB_USTAT_ENDPT_Pos)   /* (USB_USTAT) Endpoint 15 Position */
#define USB_USTAT_ENDPT_EP_14                 (USB_USTAT_ENDPT_EP_14_Val << USB_USTAT_ENDPT_Pos)   /* (USB_USTAT) Endpoint 14 Position */
#define USB_USTAT_ENDPT_EP_1                  (USB_USTAT_ENDPT_EP_1_Val << USB_USTAT_ENDPT_Pos)    /* (USB_USTAT) Endpoint 1 Position */
#define USB_USTAT_ENDPT_EP_0                  (USB_USTAT_ENDPT_EP_0_Val << USB_USTAT_ENDPT_Pos)    /* (USB_USTAT) Endpoint 0 Position */
#define USB_USTAT_Msk                         _UINT32_(0x000000FC)                                 /* (USB_USTAT) Register Mask  */


/* -------- USB_USTATCLR : (USB Offset: 0x244) (R/W 32)  -------- */
#define USB_USTATCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_USTATCLR)   Reset Value */

#define USB_USTATCLR_Msk                      _UINT32_(0x00000000)                                 /* (USB_USTATCLR) Register Mask  */


/* -------- USB_USTATSET : (USB Offset: 0x248) (R/W 32)  -------- */
#define USB_USTATSET_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_USTATSET)   Reset Value */

#define USB_USTATSET_Msk                      _UINT32_(0x00000000)                                 /* (USB_USTATSET) Register Mask  */


/* -------- USB_USTATINV : (USB Offset: 0x24C) (R/W 32)  -------- */
#define USB_USTATINV_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_USTATINV)   Reset Value */

#define USB_USTATINV_Msk                      _UINT32_(0x00000000)                                 /* (USB_USTATINV) Register Mask  */


/* -------- USB_UCON : (USB Offset: 0x250) (R/W 32) USB Control Register -------- */
#define USB_UCON_USBEN_SOFEN_Pos              _UINT32_(0)                                          /* (USB_UCON) (Device mode)USB Module Enable bit / (Host mode) Position */
#define USB_UCON_USBEN_SOFEN_Msk              (_UINT32_(0x1) << USB_UCON_USBEN_SOFEN_Pos)          /* (USB_UCON) (Device mode)USB Module Enable bit / (Host mode) Mask */
#define USB_UCON_USBEN_SOFEN(value)           (USB_UCON_USBEN_SOFEN_Msk & (_UINT32_(value) << USB_UCON_USBEN_SOFEN_Pos)) /* Assignment of value for USBEN_SOFEN in the USB_UCON register */
#define   USB_UCON_USBEN_SOFEN_ON_Val         _UINT32_(0x1)                                        /* (USB_UCON) (Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms  */
#define   USB_UCON_USBEN_SOFEN_OFF_Val        _UINT32_(0x0)                                        /* (USB_UCON) (Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled  */
#define USB_UCON_USBEN_SOFEN_ON               (USB_UCON_USBEN_SOFEN_ON_Val << USB_UCON_USBEN_SOFEN_Pos) /* (USB_UCON) (Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms Position */
#define USB_UCON_USBEN_SOFEN_OFF              (USB_UCON_USBEN_SOFEN_OFF_Val << USB_UCON_USBEN_SOFEN_Pos) /* (USB_UCON) (Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled Position */
#define USB_UCON_PPBRST_Pos                   _UINT32_(1)                                          /* (USB_UCON) Ping-Pong Buffers Reset bit Position */
#define USB_UCON_PPBRST_Msk                   (_UINT32_(0x1) << USB_UCON_PPBRST_Pos)               /* (USB_UCON) Ping-Pong Buffers Reset bit Mask */
#define USB_UCON_PPBRST(value)                (USB_UCON_PPBRST_Msk & (_UINT32_(value) << USB_UCON_PPBRST_Pos)) /* Assignment of value for PPBRST in the USB_UCON register */
#define   USB_UCON_PPBRST_RESET_Val           _UINT32_(0x1)                                        /* (USB_UCON) Reset all Even/Odd buffer pointers to the EVEN BD banks  */
#define   USB_UCON_PPBRST_NO_RESET_Val        _UINT32_(0x0)                                        /* (USB_UCON) Even/Odd buffer pointers not being Reset  */
#define USB_UCON_PPBRST_RESET                 (USB_UCON_PPBRST_RESET_Val << USB_UCON_PPBRST_Pos)   /* (USB_UCON) Reset all Even/Odd buffer pointers to the EVEN BD banks Position */
#define USB_UCON_PPBRST_NO_RESET              (USB_UCON_PPBRST_NO_RESET_Val << USB_UCON_PPBRST_Pos) /* (USB_UCON) Even/Odd buffer pointers not being Reset Position */
#define USB_UCON_RESUME_Pos                   _UINT32_(2)                                          /* (USB_UCON) RESUME Signaling Enable bit Position */
#define USB_UCON_RESUME_Msk                   (_UINT32_(0x1) << USB_UCON_RESUME_Pos)               /* (USB_UCON) RESUME Signaling Enable bit Mask */
#define USB_UCON_RESUME(value)                (USB_UCON_RESUME_Msk & (_UINT32_(value) << USB_UCON_RESUME_Pos)) /* Assignment of value for RESUME in the USB_UCON register */
#define   USB_UCON_RESUME_ON_Val              _UINT32_(0x1)                                        /* (USB_UCON) RESUME signaling is activated  */
#define   USB_UCON_RESUME_OFF_Val             _UINT32_(0x0)                                        /* (USB_UCON) RESUME signaling is disabled  */
#define USB_UCON_RESUME_ON                    (USB_UCON_RESUME_ON_Val << USB_UCON_RESUME_Pos)      /* (USB_UCON) RESUME signaling is activated Position */
#define USB_UCON_RESUME_OFF                   (USB_UCON_RESUME_OFF_Val << USB_UCON_RESUME_Pos)     /* (USB_UCON) RESUME signaling is disabled Position */
#define USB_UCON_HOSTEN_Pos                   _UINT32_(3)                                          /* (USB_UCON) Host Mode Enable bit Position */
#define USB_UCON_HOSTEN_Msk                   (_UINT32_(0x1) << USB_UCON_HOSTEN_Pos)               /* (USB_UCON) Host Mode Enable bit Mask */
#define USB_UCON_HOSTEN(value)                (USB_UCON_HOSTEN_Msk & (_UINT32_(value) << USB_UCON_HOSTEN_Pos)) /* Assignment of value for HOSTEN in the USB_UCON register */
#define   USB_UCON_HOSTEN_ON_Val              _UINT32_(0x1)                                        /* (USB_UCON) USB host capability is enabled  */
#define   USB_UCON_HOSTEN_OFF_Val             _UINT32_(0x0)                                        /* (USB_UCON) USB host capability is disabled  */
#define USB_UCON_HOSTEN_ON                    (USB_UCON_HOSTEN_ON_Val << USB_UCON_HOSTEN_Pos)      /* (USB_UCON) USB host capability is enabled Position */
#define USB_UCON_HOSTEN_OFF                   (USB_UCON_HOSTEN_OFF_Val << USB_UCON_HOSTEN_Pos)     /* (USB_UCON) USB host capability is disabled Position */
#define USB_UCON_USBRST_Pos                   _UINT32_(4)                                          /* (USB_UCON) Module Reset bit Position */
#define USB_UCON_USBRST_Msk                   (_UINT32_(0x1) << USB_UCON_USBRST_Pos)               /* (USB_UCON) Module Reset bit Mask */
#define USB_UCON_USBRST(value)                (USB_UCON_USBRST_Msk & (_UINT32_(value) << USB_UCON_USBRST_Pos)) /* Assignment of value for USBRST in the USB_UCON register */
#define   USB_UCON_USBRST_RESET_GENERATED_Val _UINT32_(0x1)                                        /* (USB_UCON) USB reset is generated  */
#define   USB_UCON_USBRST_RESET_TERMINATED_Val _UINT32_(0x0)                                        /* (USB_UCON) USB reset is terminated  */
#define USB_UCON_USBRST_RESET_GENERATED       (USB_UCON_USBRST_RESET_GENERATED_Val << USB_UCON_USBRST_Pos) /* (USB_UCON) USB reset is generated Position */
#define USB_UCON_USBRST_RESET_TERMINATED      (USB_UCON_USBRST_RESET_TERMINATED_Val << USB_UCON_USBRST_Pos) /* (USB_UCON) USB reset is terminated Position */
#define USB_UCON_PKTDIS_TOKBUSY_Pos           _UINT32_(5)                                          /* (USB_UCON) (Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit Position */
#define USB_UCON_PKTDIS_TOKBUSY_Msk           (_UINT32_(0x1) << USB_UCON_PKTDIS_TOKBUSY_Pos)       /* (USB_UCON) (Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit Mask */
#define USB_UCON_PKTDIS_TOKBUSY(value)        (USB_UCON_PKTDIS_TOKBUSY_Msk & (_UINT32_(value) << USB_UCON_PKTDIS_TOKBUSY_Pos)) /* Assignment of value for PKTDIS_TOKBUSY in the USB_UCON register */
#define   USB_UCON_PKTDIS_TOKBUSY_ON_Val      _UINT32_(0x1)                                        /* (USB_UCON) (Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module  */
#define   USB_UCON_PKTDIS_TOKBUSY_OFF_Val     _UINT32_(0x0)                                        /* (USB_UCON) (Device mode)Token and packet processing enabled / (Host mode)No token being executed  */
#define USB_UCON_PKTDIS_TOKBUSY_ON            (USB_UCON_PKTDIS_TOKBUSY_ON_Val << USB_UCON_PKTDIS_TOKBUSY_Pos) /* (USB_UCON) (Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module Position */
#define USB_UCON_PKTDIS_TOKBUSY_OFF           (USB_UCON_PKTDIS_TOKBUSY_OFF_Val << USB_UCON_PKTDIS_TOKBUSY_Pos) /* (USB_UCON) (Device mode)Token and packet processing enabled / (Host mode)No token being executed Position */
#define USB_UCON_SE0_Pos                      _UINT32_(6)                                          /* (USB_UCON) Live Single-Ended Zero flag bit Position */
#define USB_UCON_SE0_Msk                      (_UINT32_(0x1) << USB_UCON_SE0_Pos)                  /* (USB_UCON) Live Single-Ended Zero flag bit Mask */
#define USB_UCON_SE0(value)                   (USB_UCON_SE0_Msk & (_UINT32_(value) << USB_UCON_SE0_Pos)) /* Assignment of value for SE0 in the USB_UCON register */
#define   USB_UCON_SE0_DETECT_Val             _UINT32_(0x1)                                        /* (USB_UCON) Single Ended Zero detected on the USB  */
#define   USB_UCON_SE0_NOT_DETECT_Val         _UINT32_(0x0)                                        /* (USB_UCON) No Single Ended Zero detected  */
#define USB_UCON_SE0_DETECT                   (USB_UCON_SE0_DETECT_Val << USB_UCON_SE0_Pos)        /* (USB_UCON) Single Ended Zero detected on the USB Position */
#define USB_UCON_SE0_NOT_DETECT               (USB_UCON_SE0_NOT_DETECT_Val << USB_UCON_SE0_Pos)    /* (USB_UCON) No Single Ended Zero detected Position */
#define USB_UCON_JSTATE_Pos                   _UINT32_(7)                                          /* (USB_UCON) Live Differential Receiver JSTATE flag bit Position */
#define USB_UCON_JSTATE_Msk                   (_UINT32_(0x1) << USB_UCON_JSTATE_Pos)               /* (USB_UCON) Live Differential Receiver JSTATE flag bit Mask */
#define USB_UCON_JSTATE(value)                (USB_UCON_JSTATE_Msk & (_UINT32_(value) << USB_UCON_JSTATE_Pos)) /* Assignment of value for JSTATE in the USB_UCON register */
#define   USB_UCON_JSTATE_DETECT_Val          _UINT32_(0x1)                                        /* (USB_UCON) JSTATE detected on the USB  */
#define   USB_UCON_JSTATE_NOT_DETECT_Val      _UINT32_(0x0)                                        /* (USB_UCON) No JSTATE detected  */
#define USB_UCON_JSTATE_DETECT                (USB_UCON_JSTATE_DETECT_Val << USB_UCON_JSTATE_Pos)  /* (USB_UCON) JSTATE detected on the USB Position */
#define USB_UCON_JSTATE_NOT_DETECT            (USB_UCON_JSTATE_NOT_DETECT_Val << USB_UCON_JSTATE_Pos) /* (USB_UCON) No JSTATE detected Position */
#define USB_UCON_Msk                          _UINT32_(0x000000FF)                                 /* (USB_UCON) Register Mask  */

#define USB_UCON_SE_Pos                       _UINT32_(6)                                          /* (USB_UCON Position) Live Single-Ended Zero flag bit */
#define USB_UCON_SE_Msk                       (_UINT32_(0x1) << USB_UCON_SE_Pos)                   /* (USB_UCON Mask) SE */
#define USB_UCON_SE(value)                    (USB_UCON_SE_Msk & (_UINT32_(value) << USB_UCON_SE_Pos)) 

/* -------- USB_UCONCLR : (USB Offset: 0x254) (R/W 32)  -------- */
#define USB_UCONCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UCONCLR)   Reset Value */

#define USB_UCONCLR_Msk                       _UINT32_(0x00000000)                                 /* (USB_UCONCLR) Register Mask  */


