Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
/* -------- USB_USOFCLR : (USB Offset: 0x2B4) (R/W 32)  -------- */
#define USB_USOFCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_USOFCLR)   Reset Value */

#define USB_USOFCLR_Msk                       _UINT32_(0x00000000)                                 /* (USB_USOFCLR) Register Mask  */


/* -------- USB_USOFSET : (USB Offset: 0x2B8) (R/W 32)  -------- */
#define USB_USOFSET_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_USOFSET)   Reset Value */

#define USB_USOFSET_Msk                       _UINT32_(0x00000000)                                 /* (USB_USOFSET) Register Mask  */


/* -------- USB_USOFINV : (USB Offset: 0x2BC) (R/W 32)  -------- */
#define USB_USOFINV_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_USOFINV)   Reset Value */

#define USB_USOFINV_Msk                       _UINT32_(0x00000000)                                 /* (USB_USOFINV) Register Mask  */


/* -------- USB_UBDTP2 : (USB Offset: 0x2C0) (R/W 32) USB BDT PAGE 2 Register -------- */
#define USB_UBDTP2_BDTPTRH_Pos                _UINT32_(0)                                          /* (USB_UBDTP2)  Position */
#define USB_UBDTP2_BDTPTRH_Msk                (_UINT32_(0xFF) << USB_UBDTP2_BDTPTRH_Pos)           /* (USB_UBDTP2)  Mask */
#define USB_UBDTP2_BDTPTRH(value)             (USB_UBDTP2_BDTPTRH_Msk & (_UINT32_(value) << USB_UBDTP2_BDTPTRH_Pos)) /* Assignment of value for BDTPTRH in the USB_UBDTP2 register */
#define USB_UBDTP2_Msk                        _UINT32_(0x000000FF)                                 /* (USB_UBDTP2) Register Mask  */


/* -------- USB_UBDTP2CLR : (USB Offset: 0x2C4) (R/W 32)  -------- */
#define USB_UBDTP2CLR_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP2CLR)   Reset Value */

#define USB_UBDTP2CLR_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP2CLR) Register Mask  */


/* -------- USB_UBDTP2SET : (USB Offset: 0x2C8) (R/W 32)  -------- */
#define USB_UBDTP2SET_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP2SET)   Reset Value */

#define USB_UBDTP2SET_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP2SET) Register Mask  */


/* -------- USB_UBDTP2INV : (USB Offset: 0x2CC) (R/W 32)  -------- */
#define USB_UBDTP2INV_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP2INV)   Reset Value */

#define USB_UBDTP2INV_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP2INV) Register Mask  */


/* -------- USB_UBDTP3 : (USB Offset: 0x2D0) (R/W 32) USB BDT PAGE 3 Register -------- */
#define USB_UBDTP3_BDTPTRU_Pos                _UINT32_(0)                                          /* (USB_UBDTP3)  Position */
#define USB_UBDTP3_BDTPTRU_Msk                (_UINT32_(0xFF) << USB_UBDTP3_BDTPTRU_Pos)           /* (USB_UBDTP3)  Mask */
#define USB_UBDTP3_BDTPTRU(value)             (USB_UBDTP3_BDTPTRU_Msk & (_UINT32_(value) << USB_UBDTP3_BDTPTRU_Pos)) /* Assignment of value for BDTPTRU in the USB_UBDTP3 register */
#define USB_UBDTP3_Msk                        _UINT32_(0x000000FF)                                 /* (USB_UBDTP3) Register Mask  */


/* -------- USB_UBDTP3CLR : (USB Offset: 0x2D4) (R/W 32)  -------- */
#define USB_UBDTP3CLR_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP3CLR)   Reset Value */

#define USB_UBDTP3CLR_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP3CLR) Register Mask  */


/* -------- USB_UBDTP3SET : (USB Offset: 0x2D8) (R/W 32)  -------- */
#define USB_UBDTP3SET_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP3SET)   Reset Value */

#define USB_UBDTP3SET_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP3SET) Register Mask  */


/* -------- USB_UBDTP3INV : (USB Offset: 0x2DC) (R/W 32)  -------- */
#define USB_UBDTP3INV_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP3INV)   Reset Value */

#define USB_UBDTP3INV_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP3INV) Register Mask  */


/* -------- USB_UCNFG1 : (USB Offset: 0x2E0) (R/W 32) USB Configuration 1 Register -------- */
#define USB_UCNFG1_AUTO_SUSP_Pos              _UINT32_(0)                                          /* (USB_UCNFG1) Automatic Suspend Enable bit Position */
#define USB_UCNFG1_AUTO_SUSP_Msk              (_UINT32_(0x1) << USB_UCNFG1_AUTO_SUSP_Pos)          /* (USB_UCNFG1) Automatic Suspend Enable bit Mask */
#define USB_UCNFG1_AUTO_SUSP(value)           (USB_UCNFG1_AUTO_SUSP_Msk & (_UINT32_(value) << USB_UCNFG1_AUTO_SUSP_Pos)) /* Assignment of value for AUTO_SUSP in the USB_UCNFG1 register */
#define   USB_UCNFG1_AUTO_SUSP_AUTO_SUSPEND_Val _UINT32_(0x1)                                        /* (USB_UCNFG1) USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in  */
#define   USB_UCNFG1_AUTO_SUSP_NO_AUTO_SUSPEND_Val _UINT32_(0x0)                                        /* (USB_UCNFG1) USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module  */
#define USB_UCNFG1_AUTO_SUSP_AUTO_SUSPEND     (USB_UCNFG1_AUTO_SUSP_AUTO_SUSPEND_Val << USB_UCNFG1_AUTO_SUSP_Pos) /* (USB_UCNFG1) USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in Position */
#define USB_UCNFG1_AUTO_SUSP_NO_AUTO_SUSPEND  (USB_UCNFG1_AUTO_SUSP_NO_AUTO_SUSPEND_Val << USB_UCNFG1_AUTO_SUSP_Pos) /* (USB_UCNFG1) USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module Position */
#define USB_UCNFG1_LSDEV_Pos                  _UINT32_(3)                                          /* (USB_UCNFG1) Low-Speed Device Enable bit Position */
#define USB_UCNFG1_LSDEV_Msk                  (_UINT32_(0x1) << USB_UCNFG1_LSDEV_Pos)              /* (USB_UCNFG1) Low-Speed Device Enable bit Mask */
#define USB_UCNFG1_LSDEV(value)               (USB_UCNFG1_LSDEV_Msk & (_UINT32_(value) << USB_UCNFG1_LSDEV_Pos)) /* Assignment of value for LSDEV in the USB_UCNFG1 register */
#define   USB_UCNFG1_LSDEV_LOW_SPEED_Val      _UINT32_(0x1)                                        /* (USB_UCNFG1) USB module to operate in Low-Speed Device mode  */
#define   USB_UCNFG1_LSDEV_OTG_Val            _UINT32_(0x0)                                        /* (USB_UCNFG1) USB module to operate in OTG  */
#define USB_UCNFG1_LSDEV_LOW_SPEED            (USB_UCNFG1_LSDEV_LOW_SPEED_Val << USB_UCNFG1_LSDEV_Pos) /* (USB_UCNFG1) USB module to operate in Low-Speed Device mode Position */
#define USB_UCNFG1_LSDEV_OTG                  (USB_UCNFG1_LSDEV_OTG_Val << USB_UCNFG1_LSDEV_Pos)   /* (USB_UCNFG1) USB module to operate in OTG Position */
#define USB_UCNFG1_PSIDL_Pos                  _UINT32_(4)                                          /* (USB_UCNFG1) Stop in Idle Mode bit Position */
#define USB_UCNFG1_PSIDL_Msk                  (_UINT32_(0x1) << USB_UCNFG1_PSIDL_Pos)              /* (USB_UCNFG1) Stop in Idle Mode bit Mask */
#define USB_UCNFG1_PSIDL(value)               (USB_UCNFG1_PSIDL_Msk & (_UINT32_(value) << USB_UCNFG1_PSIDL_Pos)) /* Assignment of value for PSIDL in the USB_UCNFG1 register */
#define   USB_UCNFG1_PSIDL_DISCONTINUE_Val    _UINT32_(0x1)                                        /* (USB_UCNFG1) Discontinue module operation when device enters Idle mode  */
#define   USB_UCNFG1_PSIDL_CONTINUE_Val       _UINT32_(0x0)                                        /* (USB_UCNFG1) Continue module operation in Idle mode  */
#define USB_UCNFG1_PSIDL_DISCONTINUE          (USB_UCNFG1_PSIDL_DISCONTINUE_Val << USB_UCNFG1_PSIDL_Pos) /* (USB_UCNFG1) Discontinue module operation when device enters Idle mode Position */
#define USB_UCNFG1_PSIDL_CONTINUE             (USB_UCNFG1_PSIDL_CONTINUE_Val << USB_UCNFG1_PSIDL_Pos) /* (USB_UCNFG1) Continue module operation in Idle mode Position */
#define USB_UCNFG1_UOEMON_Pos                 _UINT32_(6)                                          /* (USB_UCNFG1) USB Position */
#define USB_UCNFG1_UOEMON_Msk                 (_UINT32_(0x1) << USB_UCNFG1_UOEMON_Pos)             /* (USB_UCNFG1) USB Mask */
#define USB_UCNFG1_UOEMON(value)              (USB_UCNFG1_UOEMON_Msk & (_UINT32_(value) << USB_UCNFG1_UOEMON_Pos)) /* Assignment of value for UOEMON in the USB_UCNFG1 register */
#define   USB_UCNFG1_UOEMON_ACTIVE_Val        _UINT32_(0x1)                                        /* (USB_UCNFG1) OE signal is active; it indicates intervals during which the D+/D- lines are driving  */
#define   USB_UCNFG1_UOEMON_INACTIVE_Val      _UINT32_(0x0)                                        /* (USB_UCNFG1) OE signal is inactive  */
#define USB_UCNFG1_UOEMON_ACTIVE              (USB_UCNFG1_UOEMON_ACTIVE_Val << USB_UCNFG1_UOEMON_Pos) /* (USB_UCNFG1) OE signal is active; it indicates intervals during which the D+/D- lines are driving Position */
#define USB_UCNFG1_UOEMON_INACTIVE            (USB_UCNFG1_UOEMON_INACTIVE_Val << USB_UCNFG1_UOEMON_Pos) /* (USB_UCNFG1) OE signal is inactive Position */
#define USB_UCNFG1_UTEYE_Pos                  _UINT32_(7)                                          /* (USB_UCNFG1) USB Eye-Pattern Test Enable bit Position */
#define USB_UCNFG1_UTEYE_Msk                  (_UINT32_(0x1) << USB_UCNFG1_UTEYE_Pos)              /* (USB_UCNFG1) USB Eye-Pattern Test Enable bit Mask */
#define USB_UCNFG1_UTEYE(value)               (USB_UCNFG1_UTEYE_Msk & (_UINT32_(value) << USB_UCNFG1_UTEYE_Pos)) /* Assignment of value for UTEYE in the USB_UCNFG1 register */
#define   USB_UCNFG1_UTEYE_ON_Val             _UINT32_(0x1)                                        /* (USB_UCNFG1) Eye-Pattern Test is enabled  */
#define   USB_UCNFG1_UTEYE_OFF_Val            _UINT32_(0x0)                                        /* (USB_UCNFG1) Eye-Pattern Test is disabled  */
#define USB_UCNFG1_UTEYE_ON                   (USB_UCNFG1_UTEYE_ON_Val << USB_UCNFG1_UTEYE_Pos)    /* (USB_UCNFG1) Eye-Pattern Test is enabled Position */
#define USB_UCNFG1_UTEYE_OFF                  (USB_UCNFG1_UTEYE_OFF_Val << USB_UCNFG1_UTEYE_Pos)   /* (USB_UCNFG1) Eye-Pattern Test is disabled Position */
#define USB_UCNFG1_Msk                        _UINT32_(0x000000D9)                                 /* (USB_UCNFG1) Register Mask  */


