Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/usb.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* UEP register API structure */
typedef struct
{
  __IO  uint32_t                       USB_UEPx;           /* Offset: 0x00 (R/W  32) USB Endpoint Control Registers */
  __IO  uint32_t                       USB_UEPxCLR;        /* Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       USB_UEPxSET;        /* Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       USB_UEPxINV;        /* Offset: 0x0C (R/W  32)  */
} usb_uep_registers_t;

#define USB_UEP_NUMBER 16

/* USB register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x40];
  __IO  uint32_t                       USB_UOTGIR;         /* Offset: 0x40 (R/W  32) USB OTG Interrupt Status Register */
  __IO  uint32_t                       USB_UOTGIRCLR;      /* Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       USB_UOTGIRSET;      /* Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       USB_UOTGIRINV;      /* Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       USB_UOTGIE;         /* Offset: 0x50 (R/W  32) USB OTG Interrupt Enable Register */
  __IO  uint32_t                       USB_UOTGIECLR;      /* Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       USB_UOTGIESET;      /* Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       USB_UOTGIEINV;      /* Offset: 0x5C (R/W  32)  */
  __IO  uint32_t                       USB_UOTGSTAT;       /* Offset: 0x60 (R/W  32) USB OTG Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       USB_UOTGCON;        /* Offset: 0x70 (R/W  32) USB OTG Control Register */
  __IO  uint32_t                       USB_UOTGCONCLR;     /* Offset: 0x74 (R/W  32)  */
  __IO  uint32_t                       USB_UOTGCONSET;     /* Offset: 0x78 (R/W  32)  */
  __IO  uint32_t                       USB_UOTGCONINV;     /* Offset: 0x7C (R/W  32)  */
  __IO  uint32_t                       USB_UPWRC;          /* Offset: 0x80 (R/W  32) USB Power Control Register */
  __IO  uint32_t                       USB_UPWRCCLR;       /* Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       USB_UPWRCSET;       /* Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       USB_UPWRCINV;       /* Offset: 0x8C (R/W  32)  */
  __I   uint8_t                        Reserved3[0x170];
  __IO  uint32_t                       USB_UIR;            /* Offset: 0x200 (R/W  32) USB Interrupt Register */
  __IO  uint32_t                       USB_UIRCLR;         /* Offset: 0x204 (R/W  32)  */
  __I   uint8_t                        Reserved4[0x08];
  __IO  uint32_t                       USB_UIE;            /* Offset: 0x210 (R/W  32) USB Interrupt Enable Register */
  __IO  uint32_t                       USB_UIECLR;         /* Offset: 0x214 (R/W  32)  */
  __IO  uint32_t                       USB_UIESET;         /* Offset: 0x218 (R/W  32)  */
  __IO  uint32_t                       USB_UIEINV;         /* Offset: 0x21C (R/W  32)  */
  __IO  uint32_t                       USB_UEIR;           /* Offset: 0x220 (R/W  32) USB Error Interrupt Status Register */
  __IO  uint32_t                       USB_UEIRCLR;        /* Offset: 0x224 (R/W  32)  */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       USB_UEIE;           /* Offset: 0x230 (R/W  32) USB Error Interrupt Enable Register */
  __IO  uint32_t                       USB_UEIECLR;        /* Offset: 0x234 (R/W  32)  */
  __IO  uint32_t                       USB_UEIESET;        /* Offset: 0x238 (R/W  32)  */
  __IO  uint32_t                       USB_UEIEINV;        /* Offset: 0x23C (R/W  32)  */
  __I   uint32_t                       USB_USTAT;          /* Offset: 0x240 (R/   32) USB Status Register */
  __IO  uint32_t                       USB_USTATCLR;       /* Offset: 0x244 (R/W  32)  */
  __IO  uint32_t                       USB_USTATSET;       /* Offset: 0x248 (R/W  32)  */
  __IO  uint32_t                       USB_USTATINV;       /* Offset: 0x24C (R/W  32)  */
  __IO  uint32_t                       USB_UCON;           /* Offset: 0x250 (R/W  32) USB Control Register */
  __IO  uint32_t                       USB_UCONCLR;        /* Offset: 0x254 (R/W  32)  */
  __IO  uint32_t                       USB_UCONSET;        /* Offset: 0x258 (R/W  32)  */
  __IO  uint32_t                       USB_UCONINV;        /* Offset: 0x25C (R/W  32)  */
  __IO  uint32_t                       USB_UADDR;          /* Offset: 0x260 (R/W  32) USB Address Register */
  __IO  uint32_t                       USB_UADDRCLR;       /* Offset: 0x264 (R/W  32)  */
  __IO  uint32_t                       USB_UADDRSET;       /* Offset: 0x268 (R/W  32)  */
  __IO  uint32_t                       USB_UADDRINV;       /* Offset: 0x26C (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP1;         /* Offset: 0x270 (R/W  32) USB BDT Page 1 Register */
  __IO  uint32_t                       USB_UBDTP1CLR;      /* Offset: 0x274 (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP1SET;      /* Offset: 0x278 (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP1INV;      /* Offset: 0x27C (R/W  32)  */
  __I   uint32_t                       USB_UFRML;          /* Offset: 0x280 (R/   32) USB Frame Number Low Register */
  __IO  uint32_t                       USB_UFRMLCLR;       /* Offset: 0x284 (R/W  32)  */
  __IO  uint32_t                       USB_UFRMLSET;       /* Offset: 0x288 (R/W  32)  */
  __IO  uint32_t                       USB_UFRMLINV;       /* Offset: 0x28C (R/W  32)  */
  __I   uint32_t                       USB_UFRMH;          /* Offset: 0x290 (R/   32) USB Frame Number High Register */
  __IO  uint32_t                       USB_UFRMHCLR;       /* Offset: 0x294 (R/W  32)  */
  __IO  uint32_t                       USB_UFRMHSET;       /* Offset: 0x298 (R/W  32)  */
  __IO  uint32_t                       USB_UFRMHINV;       /* Offset: 0x29C (R/W  32)  */
  __IO  uint32_t                       USB_UTOK;           /* Offset: 0x2A0 (R/W  32) USB Token Register */
  __IO  uint32_t                       USB_UTOKCLR;        /* Offset: 0x2A4 (R/W  32)  */
  __IO  uint32_t                       USB_UTOKSET;        /* Offset: 0x2A8 (R/W  32)  */
  __IO  uint32_t                       USB_UTOKINV;        /* Offset: 0x2AC (R/W  32)  */
  __IO  uint32_t                       USB_USOF;           /* Offset: 0x2B0 (R/W  32) USB SOF Threshold Register */
  __IO  uint32_t                       USB_USOFCLR;        /* Offset: 0x2B4 (R/W  32)  */
  __IO  uint32_t                       USB_USOFSET;        /* Offset: 0x2B8 (R/W  32)  */
  __IO  uint32_t                       USB_USOFINV;        /* Offset: 0x2BC (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP2;         /* Offset: 0x2C0 (R/W  32) USB BDT PAGE 2 Register */
  __IO  uint32_t                       USB_UBDTP2CLR;      /* Offset: 0x2C4 (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP2SET;      /* Offset: 0x2C8 (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP2INV;      /* Offset: 0x2CC (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP3;         /* Offset: 0x2D0 (R/W  32) USB BDT PAGE 3 Register */
  __IO  uint32_t                       USB_UBDTP3CLR;      /* Offset: 0x2D4 (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP3SET;      /* Offset: 0x2D8 (R/W  32)  */
  __IO  uint32_t                       USB_UBDTP3INV;      /* Offset: 0x2DC (R/W  32)  */
  __IO  uint32_t                       USB_UCNFG1;         /* Offset: 0x2E0 (R/W  32) USB Configuration 1 Register */
  __IO  uint32_t                       USB_UCNFG1CLR;      /* Offset: 0x2E4 (R/W  32)  */
  __IO  uint32_t                       USB_UCNFG1SET;      /* Offset: 0x2E8 (R/W  32)  */
  __IO  uint32_t                       USB_UCNFG1INV;      /* Offset: 0x2EC (R/W  32)  */
  __I   uint8_t                        Reserved6[0x10];
        usb_uep_registers_t            USB_UEP[USB_UEP_NUMBER]; /* Offset: 0x300  */
} usb_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_USB_COMPONENT_H_ */
